app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Jeratheannard"], ["updated_at", "2021-04-11 04:58:14.185005"], ["id", 4]]
---
    def update
        @student = Student.find(params[:id])
        @student.update(student_params(:first_name, :last_name))